Repository: Richasy/RichasyAssistant
Catalog: src/App/Resources/*/Resources.resw
Source language: en_us
Languages: zh_cn

source: About this app
zh_cn: 关于此应用

source: Access key
zh_cn: 访问密钥

# AccessKeyPlaceholderText
source: Key to access the service
zh_cn: 访问服务的密钥

source: Add
zh_cn: 添加

# AddKernel
source: Add new kernel
zh_cn: 添加新的内核

# AddService
source: Add new service
zh_cn: 添加新的服务

# AIMessageWarning
source: Disclaimer: The model is not omniscient, AI may generate incorrect information, please verify on your own
zh_cn: 免责声明：模型并非全知全能，AI可能生成不正确的信息，请自行核实

source: App ID
zh_cn: 应用 ID

# AppIdPlaceholderText
source: Please enter App ID
zh_cn: 请输入 App ID

source: App log
zh_cn: 应用日志

# AppLogDescription
source: Configuration items related to the app log
zh_cn: 应用日志相关的配置项

# AppName
source: Richasy Assistant
zh_cn: 小幻助理

source: App secret
zh_cn: 应用密钥

# AppSecretPlaceholderText
source: Please enter the application secret key
zh_cn: 请输入应用密钥

# AppTheme
source: Application theme
zh_cn: 应用程序主题

# AppThemeDescription
source: Select the application theme to display
zh_cn: 选择要显示的应用主题

source: Assistant
zh_cn: 助理

# AttachImage
source: Attach photo
zh_cn: 附加照片

source: Audio search
zh_cn: 音频搜索

source: Auto detect
zh_cn: 自动检测

# AzureDallETip
source: If you are using Azure DALL·E service, please fill in the form below after the resource deployment is completed, the application will provide text-to-image function through DALL·E service
zh_cn: 如果你正在使用 Azure DALL·E 服务，请在资源部署完成后填写下面的表单，应用将通过 DALL·E 服务提供文生图功能

# AzureOpenAITip
source: If you are using Azure Open AI, please fill in the form below after deploying the model, the application will use Azure Open AI as your default AI service
zh_cn: 如果你正在使用 Azure Open AI，请在部署模型后填写下面的表单，应用会使用 Azure Open AI 作为你的默认 AI 服务

source: Azure Speech
zh_cn: Azure 语音

# AzureSpeechTip
source: If you are using Azure Speech service, please fill in the form below after creating the relevant resources, the application will provide text-to-speech and speech-to-text functions through Azure Speech service
zh_cn: 如果你正在使用 Azure 语音服务，请在创建相关资源后填写下面的表单，应用将通过 Azure 语音服务 提供文本转语音和语音转文本功能

source: Azure Translate
zh_cn: Azure 翻译

# AzureTranslateTip
source: If you are using Azure Translate service (Bing Translate), please fill in the form below after creating the relevant resources, the application will use Azure Translate as your default translation service
zh_cn: 如果你正在使用 Azure 翻译服务（必应翻译），请在创建相关资源后填写下面的表单，应用会使用 Azure 翻译 作为你的默认翻译服务

source: Back
zh_cn: 返回

source: Baidu Translate
zh_cn: 百度翻译

# BaiduTranslateTip
source: If you have registered for Baidu Translate Open Platform, please fill in your application information in the form below, the application will use Baidu Translate as your default translation service
zh_cn: 如果你注册了百度翻译开放平台，请将你的应用信息填入下面的表单，应用会使用 百度翻译 作为你的默认翻译服务

# BeginChat
source: Start the conversation!
zh_cn: 开始对话吧！

# BeginChatDescription
source: Create or open a conversation and start chatting!
zh_cn: 创建或打开一个会话，然后开始聊天吧！

# BeginStorageSearch
source: Search local files
zh_cn: 搜索本地文件

# BeginStorageSearchDescription
source: Start a fast search of local files with Everything!
zh_cn: 利用 Everything 开始极速搜索本地文件吧！

source: Cancel
zh_cn: 取消

source: Chat
zh_cn: 聊天

# ChatInvalidConfiguration
source: Invalid chat service configuration
zh_cn: 聊天服务配置无效

source: Chat model name
zh_cn: 对话模型名称

# ChatModelPlaceholderText
source: Name of the deployed chat model
zh_cn: 部署的对话模型名称

source: Clear history
zh_cn: 清空历史记录

source: Clear message
zh_cn: 清空消息

# CloseLibrary
source: Close repository
zh_cn: 关闭存储库

source: Confirm
zh_cn: 确认

source: Continuous speech
zh_cn: 连续语音

source: Copied
zh_cn: 已复制

source: Copy
zh_cn: 复制

source: Copy image
zh_cn: 复制图像

source: Copy path
zh_cn: 复制路径

source: Copy prompt
zh_cn: 复制提示词

# CopyrightTemplate
source: © {0} Richasy. All rights reserved.
zh_cn: © {0} Richasy。保留所有权利。

# CopySourceContent
source: Copy input content
zh_cn: 复制输入内容

source: Copy translation result
zh_cn: 复制翻译结果

# CountLimitTemplate
source: First {0} items
zh_cn: 前 {0} 条

# CreateLibrary
source: Create repository
zh_cn: 创建存储库

# DarkTheme
source: Dark
zh_cn: 深色

# DefaultChatKernel
source: Default dialogue kernel
zh_cn: 默认对话内核

# DefaultChatKernelDescription
source: Kernel used by default when creating a new session
zh_cn: 创建新会话时默认使用的内核

# DefaultDrawService
source: Default drawing service
zh_cn: 默认绘图服务

source: Default speech service
zh_cn: 默认语音服务

# DefaultTranslateService
source: Default translation service
zh_cn: 默认翻译服务

source: Delete
zh_cn: 删除

# DeleteCustomKernelWarning
source: Do you want to delete this custom kernel? After deletion, related assistants will no longer be available
zh_cn: 是否要删除该自定义内核？删除后，相关的助理将不再可用

source: Document Search
zh_cn: 文档搜索

source: Download Everything
zh_cn: 下载 Everything

source: Draw
zh_cn: 绘图

source: Draw Configuration
zh_cn: 绘图配置

# DrawInputPlaceholderText
source: Describe the image you want to draw, such as "a snow lotus in the sea of clouds"
zh_cn: 描述你要绘制的图像，比如“云海间的一株雪莲”

# DrawInvalidConfiguration
source: Invalid Drawing Configuration
zh_cn: 绘画配置无效

# DrawInvalidConfigurationDescription
source: Please adjust the drawing-related configuration in the settings page
zh_cn: 请在设置页面中调整绘图相关的配置

# DrawService
source: Drawing Service
zh_cn: 绘图服务

# DrawSetting
source: Drawing Setting
zh_cn: 绘图设置

# DrawSettingDescription
source: Edit or add AI drawing configuration
zh_cn: 编辑或添加 AI 绘图配置

source: Edit
zh_cn: 编辑

source: Edit configuration
zh_cn: 编辑配置

source: Embedding model name
zh_cn: 嵌入模型名称

# EmbeddingModelPlaceholderText
source: Name of the deployed embedding model
zh_cn: 部署的嵌入模型名称

# EmptyResponse
source: Response is empty
zh_cn: 响应为空

source: Endpoint
zh_cn: 终结点

# EndpointPlaceholderText
source: Address of the access interface
zh_cn: 访问接口的地址

source: Execute
zh_cn: 运行

# ExportHistory
source: Export chat history
zh_cn: 导出聊天记录

# ExtraDrawLoadFailed
source: Custom drawing service loading failed, please check the custom drawing service configuration in the repository
zh_cn: 自定义绘图服务加载失败，请在存储库检查自定义绘图服务配置

# ExtraKernelLoadFailed
source: Custom kernel loading failed, please check the custom kernel configuration in the repository
zh_cn: 自定义内核加载失败，请在存储库内检查自定义内核配置

# ExtraSpeechLoadFailed
source: Custom speech service loading failed, please check the custom speech service configuration in the repository
zh_cn: 自定义语音服务加载失败，请在存储库内检查自定义语音服务配置

# ExtraTranslateLoadFailed
source: Custom translation service loading failed, please check the custom translation service configuration in the repository
zh_cn: 自定义翻译服务加载失败，请在存储库内检查自定义翻译服务配置

source: File saved
zh_cn: 文件已保存

# FinishDescription
source: Richasy Assistant will provide you with a unique AI experience based on the configuration information you provided. Enjoy your use.
zh_cn: 小幻助理将基于你提供的配置信息为你提供独特的 AI 体验，祝您使用愉快

# FinishTitle
source: You have completed all configurations!
zh_cn: 你完成了所有配置！

# FolderMustEmpty
source: You must select an empty folder
zh_cn: 您必须选择一个空文件夹

# FolderNotExist
source: Folder does not exist
zh_cn: 文件夹不存在

# FrequencyPenalty
source: Text repetition
zh_cn: 文本重复

# FrequencyPenaltyDescription
source: The higher the value, the less likely the subsequent text will repeat characters
zh_cn: 值越高，则后续产生的文本越不容易出现重复字符

source: Generate
zh_cn: 生成

# GenerateImageFailed
source: Failed to generate image, please try again later
zh_cn: 生成图片失败，请稍后再试

# GenerateResponseCancelled
source: Response generation stopped
zh_cn: 已停止生成响应

# GenerateResponseFailed
source: An exception occurred while generating response
zh_cn: 生成响应时出现异常

source: Generic
zh_cn: 通用

source: Generic search
zh_cn: 通用搜索

source: Global chat setting
zh_cn: 全局对话设置

# GlobalChatSettingDescription
source: The settings here will affect all AI chats
zh_cn: 这里的设置将影响所有 AI 对话

source: Grid layout
zh_cn: 网格布局

source: History
zh_cn: 历史记录

source: Image search
zh_cn: 图像搜索

# ImportServiceFailed
source: Import service failed, please try again later
zh_cn: 导入服务失败，请稍后重试

# InitialScriptRunningTip
source: Initial script is running, please wait for it to complete
zh_cn: 正在执行初始化脚本，请等待脚本执行完成

# InitialScriptWarning
source: This extension service requires running an initial script before import, please manually verify if the service is trustworthy
zh_cn: 该扩展服务要求在导入前运行初始化脚本，请手动验证该服务是否可信

source: Instruction
zh_cn: 指令

source: Kernel configuration
zh_cn: 内核配置

# KernelLaunchedTip
source: Kernel {0} has been launched
zh_cn: 内核 {0} 已启动

source: Kernel Service
zh_cn: 内核服务

source: Kernel Setting
zh_cn: 内核设置

# KernelSettingDescription
source: Select the appropriate kernel to provide AI dialogue function
zh_cn: 选择合适的内核提供 AI 对话功能

source: Language
zh_cn: 语言

source: Launch
zh_cn: 启动

source: Launch app
zh_cn: 启动应用

source: Launching...
zh_cn: 启动中...

# LaunchingKernelTip
source: Launching kernel: {0}
zh_cn: 正在启动内核：{0}

# LibraryChooseDescription
source: Select a blank folder as the repository for application data such as chat records, prompt word lists, etc. You can also open an existing repository to skip the initial configuration
zh_cn: 选择一个空白文件夹作为聊天记录、提示词列表等应用数据的存储库。你也可以打开一个已有的存储库以跳过初始配置

# LibraryChooseTitle
source: Select a repository
zh_cn: 选择一个存储库

# LibraryNeedInitialized
source: You must specify a folder as the application data repository
zh_cn: 您必须指定一个文件夹作为应用数据存储库

# LibrarySetting
source: Repository setting
zh_cn: 存储库设置

source: License terms
zh_cn: 许可条款

source: Light theme
zh_cn: 浅色

source: List layout
zh_cn: 列表布局

# LoadingAndWait
source: Loading, please wait
zh_cn: 加载中，请稍后

source: Load More
zh_cn: 加载更多

# MaximumResponseTokens
source: Maximum output tokens
zh_cn: 输出令牌最大值

# MaximumResponseTokensDescription
source: About 4 characters per token
zh_cn: 大约4个字符为1个令牌

source: Me
zh_cn: 我

source: Model configuration
zh_cn: 模型配置

source: Model name
zh_cn: 模型名称

# ModelNamePlaceholderText
source: Name of the deployed model
zh_cn: 部署的模型名称

source: Modified time
zh_cn: 修改时间

source: More options
zh_cn: 更多选项

source: Name (A to Z)
zh_cn: 名称（A 到 Z）

source: Name (Z to A)
zh_cn: 名称（Z 到 A）

# NeedInputText
source: Text input required
zh_cn: 必须输入文本

# NeedSelectVoice
source: A voice must be selected
zh_cn: 必须选择一个声音

source: New assistant
zh_cn: 新的助理

source: New session
zh_cn: 新会话

source: Next step
zh_cn: 下一步

# NoAssistants
source: No available assistants
zh_cn: 没有可用的助理

# NoAvailableService
source: No available extension services
zh_cn: 暂无可用的扩展服务

# NoAvailableServiceDescription
source: You can add new extension services in the settings page
zh_cn: 你可以在设置页面中添加新的扩展服务

# NoDisplayImage
source: No image displayed
zh_cn: 没有显示的图片

# NoDisplayImageDescription
source: Generate or open an image!
zh_cn: 生成或打开一张图片吧！

# NoDrawHistory
source: No drawing history
zh_cn: 没有绘图记录

# NoLimit
source: Unlimited
zh_cn: 不限

# NoMessage
source: No messages
zh_cn: 暂无消息

# NoMessageDescription
source: Type your message in the text box below!
zh_cn: 在下方的文本框中输入内容发送消息吧！

# NoName
source: Unnamed
zh_cn: 未命名

# NoSearchResult
source: No search results
zh_cn: 没有搜索结果

# NoSearchResultDescription
source: Try searching with a different keyword
zh_cn: 请换个关键词再搜索试一下吧

# NoSession
source: No available sessions
zh_cn: 暂无可用的会话

source: No translation history
zh_cn: 没有翻译记录

# OpenAIDallETip
source: If you are using Open AI DALL·E service, please fill in your token information below, the application will provide text-to-image function through DALL·E service
zh_cn: 如果你正在使用 Open AI DALL·E 服务，请在下方填写你的令牌信息，应用将通过 DALL·E 服务提供文生图功能

# OpenAITip
source: If you are using Open AI, please fill in the form below, the application will use Open AI as your default AI service
zh_cn: 如果你正在使用 Open AI，请在填写下面的表单，应用会使用 Open AI 作为你的默认 AI 服务

source: Open full window
zh_cn: 打开完整窗口

source: Open in File Explorer
zh_cn: 在文件资源管理器中打开

# OpenItemFailed
source: Failed to open item
zh_cn: 尝试打开项目时失败

# OpenLibrary
source: Open repository
zh_cn: 打开存储库

source: Open log folder
zh_cn: 打开日志文件夹

# OpenSourceImage
source: Open original image
zh_cn: 打开原图

source: Open with
zh_cn: 打开方式

# Organization
source: Organization (optional)
zh_cn: 组织（选填）

# OrganizationPlaceholderText
source: Enter organization name
zh_cn: 填写组织名称

# PlayAndPause
source: Play / Pause
zh_cn: 播放 / 暂停

# PoweredBy
source: Powered by {0}
zh_cn: 基于 {0} 提供

# PresencePenalty
source: Topic repetition
zh_cn: 话题重复

# PresencePenaltyDescription
source: The higher the value, the more likely the subsequent text will discuss new topics
zh_cn: 值越高，则后续文本越容易讨论新的话题

source: Preset session
zh_cn: 预设会话

# PrevStep
source: Previous step
zh_cn: 上一步

source: Privacy policy
zh_cn: 隐私策略

source: Program search
zh_cn: 程序搜索

source: Prompt
zh_cn: 提示词

# ProxyEndpoint
source: Proxy endpoint (optional)
zh_cn: 代理终结点（选填）

# ProxyEndpointPlaceholderText
source: Enter a trusted proxy service address
zh_cn: 填写可信的代理服务地址

source: Recent session
zh_cn: 近期会话

source: Recognized text
zh_cn: 已识别的文本

source: Regenerate
zh_cn: 重新生成

source: Region
zh_cn: 地区

# RegionPlaceholderText
source: Service location
zh_cn: 服务所在地区

source: Repeatability
zh_cn: 重复度

# RepeatabilityDescription
source: Control the repeatability of text or topic in the model
zh_cn: 控制模型对文字或话题的重复度

source: Repeat file
zh_cn: 重复文件

# RequestVoiceMetadataFailed
source: Request for voice data failed
zh_cn: 请求声音数据失败

# Resent
source: Resend
zh_cn: 重新发送

source: Restart
zh_cn: 重新启动

source: Retry
zh_cn: 重试

source: Sampling
zh_cn: 采样

# SamplingDescription
source: Set sampling parameters to determine the randomness of the answer
zh_cn: 设置采样参数，以此决定答案的随机性

source: Save as
zh_cn: 另存为

source: Save audio
zh_cn: 保存音频

# SaveFileFailed
source: Failed to save file, please try again later
zh_cn: 保存文件失败，请稍后再试

source: Search
zh_cn: 搜索

source: Search by name
zh_cn: 按名称搜索

# SearchingAndWaiting
source: Searching, please wait
zh_cn: 搜索中，请稍候

# SearchResultTip
source: Found {0} results
zh_cn: 查找出 {0} 条结果

# SearchResultTipWithLimit
source: There are a total of {0} results, the first {1} are displayed for you
zh_cn: 总共有 {0} 条结果，已为您展示前 {1} 条

source: Send feedback
zh_cn: 发送反馈

source: Send message
zh_cn: 发送消息

source: Service
zh_cn: 服务

source: Services
zh_cn: 服务

source: Session
zh_cn: 会话

# SessionOption
source: Session settings
zh_cn: 会话设置

source: Session title
zh_cn: 会话标题

source: Settings
zh_cn: 设置

source: Size
zh_cn: 大小

# SizeLargeToSmall
source: Size (from large to small)
zh_cn: 大小（从大到小）

# SizeSmallToLarge
source: Size (from small to large)
zh_cn: 大小（从小到大）

source: Skip
zh_cn: 跳过

# SomethingWrong
source: Something went wrong!
zh_cn: 出错了！

source: Sort by
zh_cn: 排序

source: Source language
zh_cn: 源语言

source: Speech
zh_cn: 语音

source: Speech configuration
zh_cn: 语音配置

# SpeechConvertFailed
source: An exception occurred while trying to convert speech
zh_cn: 尝试转换语音时发生了异常

source: Speech input
zh_cn: 语音输入

source: Speech recognition
zh_cn: 语音识别

# SpeechRecognizeFailed
source: Speech recognition failed
zh_cn: 语音识别失败

source: Speech service
zh_cn: 语音服务

source: Speech setting
zh_cn: 语音设置

# SpeechSettingDescription
source: Edit or add speech service
zh_cn: 编辑或添加语音服务

source: Start recording
zh_cn: 开始录制

source: Stop
zh_cn: 停止

source: Stop recording
zh_cn: 停止录制

# Storage
source: File
zh_cn: 文件

# StorageInvalid
source: Storage search service Unavailable
zh_cn: 存储搜索服务不可用

# StorageInvalidDescription
source: Storage search service requires Everything to be installed on this machine first
zh_cn: 存储搜索服务需要先在本机安装 Everything

source: Storage search
zh_cn: 存储搜索

# StorageSearchMaxCount
source: Maximum display items for storage search
zh_cn: 存储搜索最大显示条目

# StorageSearchMaxCountDescription
source: Set the maximum number of search results to display in local storage search
zh_cn: 设置在本地存储搜索中最多显示多少条搜索结果

# StorageSearchPlaceholder
source: Find files based on Everything
zh_cn: 基于 Everything 查找文件

# SystemDefault
source: Use system settings
zh_cn: 使用系统设置

source: Target language
zh_cn: 目标语言

# TemperatureDescription
source: Control randomness, reducing temperature will result in fewer random completions.
zh_cn: 控制随机性，降低 temperature 会导致更少的随机完成。

source: Text completion model name
zh_cn: 文本完成模型名称

# TextCompletionModelPlaceholderText
source: Name of the deployed text completion model
zh_cn: 部署的文本完成模型名称

source: Text to speech
zh_cn: 文本转语音

source: Text translate
zh_cn: 文本翻译

source: Tip
zh_cn: 提醒

# TopPDescription
source: Control diversity through nucleus sampling
zh_cn: 通过核采样控制多样性

source: Translate
zh_cn: 翻译

source: Translate configuration
zh_cn: 翻译配置

# TranslatedContentPlaceholderText
source: Translated text will be displayed here
zh_cn: 翻译后的文本将显示在这里

# TranslateInvalid
source: Translation service is unavailable
zh_cn: 翻译服务不可用

# TranslateInvalidDescription
source: Please complete the translation service related configuration in the settings
zh_cn: 请在设置中完成翻译服务相关的配置

# TranslateService
source: Translation Service
zh_cn: 翻译服务

# TranslateSetting
source: Translation Settings
zh_cn: 翻译设置

# TranslateSettingDescription
source: Edit or add translation services
zh_cn: 编辑或添加翻译服务

# TranslationInputPlaceholderText
source: Please enter the text to be translated
zh_cn: 请输入要翻译的文本

source: Type
zh_cn: 类型

# UnknownError
source: An unknown error occurred
zh_cn: 发生了未知错误

source: Use markdown renderer
zh_cn: 使用 Markdown 渲染器

# UseMarkdownRendererDescription
source: Conversation messages will be rendered using the native Markdown renderer, text selection may be affected
zh_cn: 对话消息将使用本机 Markdown 渲染器渲染，文本选择可能受到影响

# UserInputPlaceholderText
source: Enter message
zh_cn: 输入消息

source: Use stream output
zh_cn: 使用流式输出

# UseStreamOutputDescription
source: The model will generate responses word by word (typewriter mode)
zh_cn: 模型会逐字逐句生成响应（打字机模式）

source: Video search
zh_cn: 视频搜索

source: Voice
zh_cn: 声音

# VoiceConfigInvalid
source: Please complete the voice-related service configuration in the settings
zh_cn: 请在设置中完善语音相关的服务配置

# VoiceDependenciesMissing
source: You need to click the link below to download C++ dependencies to use this feature
zh_cn: 你需要点击下面的链接下载 C++ 依赖才能使用该功能

# VoiceInvalid
source: Voice service is unavailable
zh_cn: 语音服务不可用

# WaitServiceLaunching
source: Please wait until the service is fully launched before operating
zh_cn: 请等待服务启动完成后再操作

# WelcomeDescription
source: Before you start, please follow me to do some simple configurations!
zh_cn: 在开始使用前，请跟随我一起做一些简单的配置吧！

# WelcomeTitle
source: Welcome to use Xiao Huan Assistant
zh_cn: 欢迎使用小幻助理

source: Zip search
zh_cn: 压缩包搜索
